Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-03 四 14:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs study note</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs study note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org062df77">1. Basic operation</a>
<ul>
<li><a href="#org027e766">1.1. Introduction</a>
<ul>
<li><a href="#orgd1d4734">1.1.1. Advancement</a></li>
</ul>
</li>
<li><a href="#org59733d6">1.2. Getting started</a>
<ul>
<li><a href="#org06b468c">1.2.1. Entering Emacs</a></li>
<li><a href="#org05f4fe8">1.2.2. Exiting Emacs</a></li>
</ul>
</li>
<li><a href="#orgdb988cb">1.3. Screen organization</a>
<ul>
<li><a href="#orgc1f1b2c">1.3.1. The <b>Frame</b>: a graphic window or terminal screen occupied by emacs.</a></li>
</ul>
</li>
<li><a href="#orgc3b9110">1.4. Editing elements</a>
<ul>
<li><a href="#orgacf5159">1.4.1. <b>Point</b>: a basic conception of cursor</a></li>
<li><a href="#org9084df3">1.4.2. <b>Mark</b></a></li>
<li><a href="#orgf30987f">1.4.3. <b>Region</b></a></li>
<li><a href="#org92b56ce">1.4.4. <b>Ring</b></a></li>
</ul>
</li>
<li><a href="#orga0d3219">1.5. Charactors, Keys and Commands</a>
<ul>
<li><a href="#orgbf3866e">1.5.1. Charactors</a></li>
<li><a href="#orgafbc4be">1.5.2. Keys</a></li>
<li><a href="#org439e72a">1.5.3. Commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3816c48">2. Emacs Lisp</a></li>
<li><a href="#org1ad2802">3. Awesome org-mode</a></li>
</ul>
</div>
</div>
<p>
Hello, I am reading emacs official guide
Here I record things I encountered
</p>

<div id="outline-container-org062df77" class="outline-2">
<h2 id="org062df77"><span class="section-number-2">1</span> Basic operation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org027e766" class="outline-3">
<h3 id="org027e766"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>GNU Emacs</b>
</p>
</div>
<div id="outline-container-orgd1d4734" class="outline-4">
<h4 id="orgd1d4734"><span class="section-number-4">1.1.1</span> Advancement</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Controling of processes</li>
<li>Self-documenting</li>
<li>Customization</li>
<li>Extensible(with <i>emacs lisp</i>)</li>
<li>Powerful org-mode</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org59733d6" class="outline-3">
<h3 id="org59733d6"><span class="section-number-3">1.2</span> Getting started</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org06b468c" class="outline-4">
<h4 id="org06b468c"><span class="section-number-4">1.2.1</span> Entering Emacs</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Just type
</p>
<pre class="example">
emacs
</pre>
<p>
and here we are!
</p>

<pre class="example">
C-h t
Emacs Tutorial
</pre>

<p>
If we do not want to display the startup screen(which I think is ugly:(),
set the variable
</p>
<pre class="example">
inhibit-startup-screen
</pre>
<p>
to <code>nil</code>
then instead, Emacs will display a buffer named <b><b>scratch</b></b>
which can be used to evaluate elisp codes.
</p>

<p>
Moreover, we can also force emacs to display certain file at startup by setting the variable
</p>
<pre class="example">
initial-buffer-choice
</pre>
<p>
to a file path
</p>
</div>
</div>

<div id="outline-container-org05f4fe8" class="outline-4">
<h4 id="org05f4fe8"><span class="section-number-4">1.2.2</span> Exiting Emacs</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>C-x C-c : Kill Emacs</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">command</td>
<td class="org-left">function</td>
</tr>

<tr>
<td class="org-left">confirm-kill-processes</td>
<td class="org-left">ask for confirmation for killing subprocesses</td>
</tr>

<tr>
<td class="org-left">confirm-kill-emacs</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>C-z</li>
</ul>
<pre class="example">
(if (on text terminal) 
  (suspend Emacs) 
  (minimize selected frame))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb988cb" class="outline-3">
<h3 id="orgdb988cb"><span class="section-number-3">1.3</span> Screen organization</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgc1f1b2c" class="outline-4">
<h4 id="orgc1f1b2c"><span class="section-number-4">1.3.1</span> The <b>Frame</b>: a graphic window or terminal screen occupied by emacs.</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Contains several <b>Regions</b>
</p>
</div>
<ol class="org-ol">
<li><a id="org377383a"></a>Menu bar<br />
<div class="outline-text-5" id="text-1-3-1-1">
<pre class="example">
F10
to open menu(menu-bar-open)
</pre>
</div>
</li>

<li><a id="org6d88366"></a>Tool bar<br /></li>
<li><a id="org88e9069"></a>Window(text area): display <i>buffer</i><br />
<div class="outline-text-5" id="text-1-3-1-3">
<p>
at least one selected at any time
</p>
</div>
</li>
<li><a id="orgd2f524f"></a>Mode line<br />
<div class="outline-text-5" id="text-1-3-1-4">
<p>
Describe current buffer
</p>
<pre class="example">
Format: 
cs:ch-fr buf      pos line   (major minor)
</pre>
<p>
where
</p>
<ul class="org-ul">
<li>cs =&gt; charactor set
<ul class="org-ul">
<li><b>-</b> =&gt; no special char set</li>
<li><b>=</b> =&gt; no conversion</li>
</ul></li>

<li>ch
<ul class="org-ul">
<li><b>--</b> =&gt; same content as file in disk</li>
<li>**   =&gt; buffer is modified</li>
<li><b>%*</b> =&gt; buffer is modified for read-only file</li>
<li><b>%%</b> =&gt; otherwise</li>
</ul></li>

<li>-
<ul class="org-ul">
<li><b>-</b> =&gt; normal</li>
<li><b>@</b> =&gt; default-directory is on a remote machine</li>
</ul></li>

<li>fr: file name(terminal only)</li>

<li>buf: buffer name</li>
</ul>
</div>
</li>

<li><a id="org96e65c4"></a>Echo area<br />
<div class="outline-text-5" id="text-1-3-1-5">
<ul class="org-ul">
<li><p>
for echoing commands and errors
</p>
<pre class="example">
  C-x =
  Display a message describing the char at point, its position and its current column
</pre>
<p>
the message are saved in a special buffer named <b><b>Message</b></b>,
the variable
</p>
<pre class="example">
  message-log-max
</pre>
<p>
limit <b><b>Message</b></b> buffer to a certain number of lines
</p></li>

<li><p>
To display the <b>minibuffer</b>
a special window to input some commands
can always get out of <b>minibuffer</b> by typing in
</p>
<pre class="example">
  C-g
</pre></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org718be52"></a>Minibuffer<br />
<div class="outline-text-6" id="text-1-3-1-5-1">
<ul class="org-ul">
<li>Completion</li>
<li><p>
History
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-p</td>
<td class="org-left">M-n</td>
</tr>

<tr>
<td class="org-left">UP</td>
<td class="org-left">DOWN</td>
</tr>

<tr>
<td class="org-left">previous-history-element</td>
<td class="org-left">next-history-element</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgc3b9110" class="outline-3">
<h3 id="orgc3b9110"><span class="section-number-3">1.4</span> Editing elements</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgacf5159" class="outline-4">
<h4 id="orgacf5159"><span class="section-number-4">1.4.1</span> <b>Point</b>: a basic conception of cursor</h4>
</div>
<div id="outline-container-org9084df3" class="outline-4">
<h4 id="org9084df3"><span class="section-number-4">1.4.2</span> <b>Mark</b></h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><p>
<b>Setting mark</b> (Very useful:)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-SPC</td>
<td class="org-left">Set mark at point and activate</td>
</tr>

<tr>
<td class="org-left">C-@</td>
<td class="org-left">same as above</td>
</tr>

<tr>
<td class="org-left">C-x C-x</td>
<td class="org-left">C-SPC then exchange last mark with point</td>
</tr>

<tr>
<td class="org-left">M-@</td>
<td class="org-left">(mark-word)mark end of next word</td>
</tr>

<tr>
<td class="org-left">M-h</td>
<td class="org-left">point =&gt; begining of para and mark end of para</td>
</tr>

<tr>
<td class="org-left">C-x C-p</td>
<td class="org-left">point =&gt; begining of page and mark end of page</td>
</tr>

<tr>
<td class="org-left">C-x h</td>
<td class="org-left">point =&gt; begining of buff and mark end of buff</td>
</tr>
</tbody>
</table></li>

<li><p>
<b>Mark Ring</b>  
Every buffer has a <i>mark ring</i>.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-SPC C-SPC</td>
<td class="org-left">set mark without activating it</td>
</tr>

<tr>
<td class="org-left">C-u</td>
<td class="org-left">C-SPC =&gt; Jump to previous mark</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-orgf30987f" class="outline-4">
<h4 id="orgf30987f"><span class="section-number-4">1.4.3</span> <b>Region</b></h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><p>
Operations on region
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-w</td>
<td class="org-left">Kill it</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">Copy it</td>
</tr>

<tr>
<td class="org-left">C-x C-[lu]</td>
<td class="org-left">Convert case:(some how disabled)</td>
</tr>

<tr>
<td class="org-left">C-u C-/</td>
<td class="org-left">Undo within</td>
</tr>

<tr>
<td class="org-left">C-x TAB</td>
<td class="org-left">Indent</td>
</tr>

<tr>
<td class="org-left">C-M-\</td>
<td class="org-left">same as above</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org92b56ce" class="outline-4">
<h4 id="org92b56ce"><span class="section-number-4">1.4.4</span> <b>Ring</b></h4>
<div class="outline-text-4" id="text-1-4-4">
</div>
<ol class="org-ol">
<li><a id="orge75387d"></a>Mark Ring<br /></li>
<li><a id="org72452e3"></a>Kill Ring<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orga0d3219" class="outline-3">
<h3 id="orga0d3219"><span class="section-number-3">1.5</span> Charactors, Keys and Commands</h3>
<div class="outline-text-3" id="text-1-5">
</div>
