Emacs.org
*** Charactors
#+BEGIN_SRC 
Control => Ctrl
Alt     => Meta(default)
#+END_SRC
- Shortcuts:
  - C-x : Control-x
  - M-x : Meta-x

Moreover, you can just type [ESC] before charactors to envoke Meta, for example,
#+BEGIN_SRC 
ESC a   === M-a
ESC C-a === C-M-a
#+END_SRC

/note:/ Emacs may be blocked by window manager, be careful:)

*** Keys
- Complete key
- Prefix key
  | C-c     | C-h   | C-x   |
  | C-x RET | C-x @ | C-x a |
  | C-x n   | C-x r | C-x v |
  | C-x 4   | C-x 5 | C-x 6 |
  | ESC     | M-g   | M-o   |

*** Commands
**** Inserting Text

- Overview
  | Key   | Function             |
  |-------+----------------------|
  | RET   | newline              |
  | C-o   | open-line            |
  | DEL   | delete-backward-char |
  | C-q   | quoted-insert        |
  | C-x 8 |                      |

- Usage of =C-q=
  1) insert special charactor(like [DEL])
  2) insert with octal number
    #+BEGIN_SRC 
    C-q 1 0 1 B => insert 'AB'
    #+END_SRC

**** Changing location of Point
- Keys for arrow operations
  |     | C-p |     |    |
  | C-b |     | C-f | => |
  |     | C-n |     |    |
  
  -----
  |               | previous-line |              |    
  | backward-char |               | forward-char |    
  |               | next-line     |              |    

  -----
  |      | UP   |       |    |
  | LEFT |      | RIGHT | => |
  |      | DOWN |       |    |

  -----
  |           | previous-line |            |    
  | left-char |               | right-char |    
  |           | next-line     |            |    

- Inline operations
  | C-a                   | C-e              |
  | Home                  | End              |
  | move-begining-of-line | move-end-of-line |

  -----
  | M-b           | M-f          |
  | backward-word | forward-word |
  |               |              |
  | C-LEFT        | C-RIGHT      |
  | M-LEFT        | M-RIGHT      |
  | left-word     | right-word   |

- Reposition line
  #+BEGIN_SRC 
  M-r
  move-to-window-line-top-bottom
  --without moving the text on the screen, move point to leftmost of the center line
  #+END_SRC  

- Global jump
  | M-<                | M->           |
  | begining-of-buffer | end-of-buffer |
  
  -----
  | C-v               | M-v                 |
  | PageDown          | PageUp              |
  | next              | prior               |
  | scroll-up-command | scroll-down-command |

  #+BEGIN_SRC 
  M-g c
  \n => go to position n
  #+END_SRC
   
  | M-g M-g   | M-g TAB        |
  | M-g g     |                |
  | goto-line | move-to-column |

  #+BEGIN_SRC 
  C-x C-n         C-u C-x C-n
  #+END_SRC

**** Erasing Text

| DEL                  | Delete              |
| BACKSPACE            |                     |
| delete-backward-char | delete-forward-char |

-----
| C-d         | M-d       |
| delete-char | kill-word |
// all forward

| Key         | Function                           |
|-------------+------------------------------------|
| C-k         | kill-line                          |
| M-DEL       | backward-kill-word                 |
| M-BACKSPACE | same                               |
| C-x C-o     | delete-blank-lines                 |
| M-^         | (delete indentation)Join two lines |
|             |                                    |

**** Yanking
| C-y | Yank last kill into point     |
| M-y | Replace text with last killed |

**** Undoing
#+BEGIN_SRC 
C-/
C-x u
C-_
#+END_SRC

**** Files
#+BEGIN_SRC 
C-x C-f        C-x C-s
find-file      save-buffer
#+END_SRC

**** Help
#+BEGIN_SRC 
C-h k
describe-key
\key => describe key
#+END_SRC

**** Information
| Key             | Command                       |
|-----------------+-------------------------------|
| M-x what-line   | what-line                     |
| M-=             | count-words-region            |
| M-x count-words | count-words(of whole buffer:) |
| C-x =           | what-cursor-position          |

