Emacs.html
<div id="outline-container-orgbf3866e" class="outline-4">
<h4 id="orgbf3866e"><span class="section-number-4">1.5.1</span> Charactors</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example">
Control =&gt; Ctrl
Alt     =&gt; Meta(default)
</pre>
<ul class="org-ul">
<li>Shortcuts:
<ul class="org-ul">
<li>C-x : Control-x</li>
<li>M-x : Meta-x</li>
</ul></li>
</ul>

<p>
Moreover, you can just type [ESC] before charactors to envoke Meta, for example,
</p>
<pre class="example">
ESC a   === M-a
ESC C-a === C-M-a
</pre>

<p>
<i>note:</i> Emacs may be blocked by window manager, be careful:)
</p>
</div>
</div>

<div id="outline-container-orgafbc4be" class="outline-4">
<h4 id="orgafbc4be"><span class="section-number-4">1.5.2</span> Keys</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>Complete key</li>
<li><p>
Prefix key
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-c</td>
<td class="org-left">C-h</td>
<td class="org-left">C-x</td>
</tr>

<tr>
<td class="org-left">C-x RET</td>
<td class="org-left">C-x @</td>
<td class="org-left">C-x a</td>
</tr>

<tr>
<td class="org-left">C-x n</td>
<td class="org-left">C-x r</td>
<td class="org-left">C-x v</td>
</tr>

<tr>
<td class="org-left">C-x 4</td>
<td class="org-left">C-x 5</td>
<td class="org-left">C-x 6</td>
</tr>

<tr>
<td class="org-left">ESC</td>
<td class="org-left">M-g</td>
<td class="org-left">M-o</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org439e72a" class="outline-4">
<h4 id="org439e72a"><span class="section-number-4">1.5.3</span> Commands</h4>
<div class="outline-text-4" id="text-1-5-3">
</div>
<ol class="org-ol">
<li><a id="org0ef0bff"></a>Inserting Text<br />
<div class="outline-text-5" id="text-1-5-3-1">
<ul class="org-ul">
<li><p>
Overview
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RET</td>
<td class="org-left">newline</td>
</tr>

<tr>
<td class="org-left">C-o</td>
<td class="org-left">open-line</td>
</tr>

<tr>
<td class="org-left">DEL</td>
<td class="org-left">delete-backward-char</td>
</tr>

<tr>
<td class="org-left">C-q</td>
<td class="org-left">quoted-insert</td>
</tr>

<tr>
<td class="org-left">C-x 8</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>

<li>Usage of <code>C-q</code>
<ol class="org-ol">
<li>insert special charactor(like [DEL])</li>
<li><p>
insert with octal number
</p>
<pre class="example">
    C-q 1 0 1 B =&gt; insert 'AB'
</pre></li>
</ol></li>
</ul>
</div>
</li>

<li><a id="org0d80291"></a>Changing location of Point<br />
<div class="outline-text-5" id="text-1-5-3-2">
<ul class="org-ul">
<li><p>
Keys for arrow operations
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-p</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-f</td>
<td class="org-left">=&gt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-n</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">previous-line</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">backward-char</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">forward-char</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">next-line</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">UP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEFT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">RIGHT</td>
<td class="org-left">=&gt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DOWN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">previous-line</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">left-char</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">right-char</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">next-line</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>

<li><p>
Inline operations
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-a</td>
<td class="org-left">C-e</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">End</td>
</tr>

<tr>
<td class="org-left">move-begining-of-line</td>
<td class="org-left">move-end-of-line</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-b</td>
<td class="org-left">M-f</td>
</tr>

<tr>
<td class="org-left">backward-word</td>
<td class="org-left">forward-word</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-LEFT</td>
<td class="org-left">C-RIGHT</td>
</tr>

<tr>
<td class="org-left">M-LEFT</td>
<td class="org-left">M-RIGHT</td>
</tr>

<tr>
<td class="org-left">left-word</td>
<td class="org-left">right-word</td>
</tr>
</tbody>
</table></li>

<li><p>
Reposition line
</p>
<pre class="example">
  M-r
  move-to-window-line-top-bottom
  --without moving the text on the screen, move point to leftmost of the center line
</pre></li>

<li><p>
Global jump
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">M-&gt;</td>
</tr>

<tr>
<td class="org-left">begining-of-buffer</td>
<td class="org-left">end-of-buffer</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-v</td>
<td class="org-left">M-v</td>
</tr>

<tr>
<td class="org-left">PageDown</td>
<td class="org-left">PageUp</td>
</tr>

<tr>
<td class="org-left">next</td>
<td class="org-left">prior</td>
</tr>

<tr>
<td class="org-left">scroll-up-command</td>
<td class="org-left">scroll-down-command</td>
</tr>
</tbody>
</table>

<pre class="example">
  M-g c
  \n =&gt; go to position n
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-g M-g</td>
<td class="org-left">M-g TAB</td>
</tr>

<tr>
<td class="org-left">M-g g</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">goto-line</td>
<td class="org-left">move-to-column</td>
</tr>
</tbody>
</table>

<pre class="example">
  C-x C-n         C-u C-x C-n
</pre></li>
</ul>
</div>
</li>

<li><a id="orgb117bc4"></a>Erasing Text<br />
<div class="outline-text-5" id="text-1-5-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">DEL</td>
<td class="org-left">Delete</td>
</tr>

<tr>
<td class="org-left">BACKSPACE</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">delete-backward-char</td>
<td class="org-left">delete-forward-char</td>
</tr>
</tbody>
</table>

<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-d</td>
<td class="org-left">M-d</td>
</tr>

<tr>
<td class="org-left">delete-char</td>
<td class="org-left">kill-word</td>
</tr>
</tbody>
</table>
<p>
// all forward
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-k</td>
<td class="org-left">kill-line</td>
</tr>

<tr>
<td class="org-left">M-DEL</td>
<td class="org-left">backward-kill-word</td>
</tr>

<tr>
<td class="org-left">M-BACKSPACE</td>
<td class="org-left">same</td>
</tr>

<tr>
<td class="org-left">C-x C-o</td>
<td class="org-left">delete-blank-lines</td>
</tr>

<tr>
<td class="org-left">M-^</td>
<td class="org-left">(delete indentation)Join two lines</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="orgf5479b9"></a>Yanking<br />
<div class="outline-text-5" id="text-1-5-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-y</td>
<td class="org-left">Yank last kill into point</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">Replace text with last killed</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="orgea924ec"></a>Undoing<br />
<div class="outline-text-5" id="text-1-5-3-5">
<pre class="example">
C-/
C-x u
C-_
</pre>
</div>
</li>

<li><a id="org7399e11"></a>Files<br />
<div class="outline-text-5" id="text-1-5-3-6">
<pre class="example">
C-x C-f        C-x C-s
find-file      save-buffer
</pre>
</div>
</li>

<li><a id="org54d66d9"></a>Help<br />
<div class="outline-text-5" id="text-1-5-3-7">
<pre class="example">
C-h k
describe-key
\key =&gt; describe key
</pre>
</div>
</li>

<li><a id="org61eceae"></a>Information<br />
<div class="outline-text-5" id="text-1-5-3-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-x what-line</td>
<td class="org-left">what-line</td>
</tr>

<tr>
<td class="org-left">M-=</td>
<td class="org-left">count-words-region</td>
</tr>

<tr>
<td class="org-left">M-x count-words</td>
<td class="org-left">count-words(of whole buffer:)</td>
</tr>

<tr>
<td class="org-left">C-x =</td>
<td class="org-left">what-cursor-position</td>
</tr>
</tbody>
</table>
</div>
</li>
